* TODO TIC TAC TOE game
The exercise involves developing a Tic-Tac-Toe game strictly adhering to the TDD rules.
** DONE 1 – Game Board Creation phase
   - State "DONE"       from "TODO"       [2021-03-29 Mon 16:59]
*** DONE describe board
    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 16:59]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 16:46]
** TODO describe winning scenarios
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 17:01]--[2021-03-29 Mon 17:04] =>  0:03
   :END:
*** DONE player with all cells in row wins
    - State "DONE"       from "TODO"       [2021-03-29 Mon 18:53]
*** DONE player with all cells in column wins
    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 19:07]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:53]
    :LOGBOOK:
    CLOCK: [2021-03-29 Mon 18:53]--[2021-03-29 Mon 19:07] =>  0:14
    :END:
*** DONE asc diagonale winning scenario
    - State "DONE"       from "TODO"       [2021-03-29 Mon 21:14]
*** DONE desc diagnoel winning scenario
    - State "DONE"       from "TODO"       [2021-03-29 Mon 21:17]
** IN-PROGRESS describe board operations
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:14]
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 17:04]--[2021-03-29 Mon 17:11] =>  0:07
   :END:
*** DONE get diagonale forward

    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 19:48]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 19:11]
*** DONE get desc diagonale

    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 21:06]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 19:48]
*** DONE occupy 0 row and 0 collumn by player X
    - State "DONE"       from "TODO"       [2021-03-29 Mon 18:01]
    :LOGBOOK:
    CLOCK: [2021-03-29 Mon 17:58]--[2021-03-29 Mon 18:01] =>  0:03
    CLOCK: [2021-03-29 Mon 17:32]--[2021-03-29 Mon 17:41] =>  0:09
    CLOCK: [2021-03-29 Mon 17:16]--[2021-03-29 Mon 17:27] =>  0:11
    :END:
*** DONE retrieve board row by index offset
    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 18:51]
    :LOGBOOK:
    CLOCK: [2021-03-29 Mon 18:14]--[2021-03-29 Mon 18:23] =>  0:09
    :END:
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:14]
*** DONE retrieve bord column by index offset
    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 19:05]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:56]
** IN-PROGRESS describe player move
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 21:18]
*** DONE how player makes a move
    - State "DONE"       from "TODO"       [2021-03-29 Mon 21:54]
** TODO display board-size
*** DONE display row
    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 22:30]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 22:15]
*** DONE board should be rendered using terminal

    - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 22:30]
    - State "IN-PROGRESS" from "IN-PROGRESS" [2021-03-29 Mon 22:30]
    - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 21:55]
* Tech debt
** DONE extract board offset  calculation
   - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 17:32]
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 17:27]--[2021-03-29 Mon 17:32] =>  0:05
   :END:
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 17:27]
** DONE complicated won logic refactor!
   - State "DONE"       from "IN-PROGRESS" [2021-03-29 Mon 18:52]
   - State "IN-PROGRESS" from "TODO"       [2021-03-29 Mon 18:01]
   :LOGBOOK:
   CLOCK: [2021-03-29 Mon 18:01]--[2021-03-29 Mon 18:14] =>  0:13
   :END:
** TODO extract won logic as it is same for row,col and most probably diagonale
** TODO cleanup board diagnoale functions
** TODO define function is-empty to test for board cell emptines
** TODO  we most probably do not need board offset (examine and refactor)
